# GetDoubleClickOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleClickOptions..::..GetDoubleClickOptions Method
DoubleClickOptions Class See Also
---
Returns the current user's DoubleClickOptions.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static DoubleClickOptions GetDoubleClickOptions()
```

Visual Basic
---
```text
Public Shared Function GetDoubleClickOptions As DoubleClickOptions
```

Visual C++
---
```text
public:
static DoubleClickOptions^ GetDoubleClickOptions()
```

# ### Return Value
The DoubleClickOptions for the current user.
# See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace